In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("data/BA_reviews.csv", index_col=0)
df.head()

                                             reviews  stars         country
0  ✅ Trip Verified | Once again a terrible busine...      5  United Kingdom
1  ✅ Trip Verified |  BA A380's are showing their...      3  United Kingdom
2  ✅ Trip Verified |   Credit to BA - Flew to Sin...      4  United Kingdom
3  ✅ Trip Verified |   The check in area for prem...      9  United Kingdom
4  ✅ Trip Verified |  The flight took off a littl...      9  United Kingdom

In [3]:
df["reviews"] = df["reviews"].str.replace("✅ Trip Verified |", "")
df.head()

C:\Users\user\AppData\Local\Temp\ipykernel_2436\2448596576.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df["reviews"] = df["reviews"].str.replace("✅ Trip Verified |", "")

                                             reviews  stars         country
0  | Once again a terrible business class experie...      5  United Kingdom
1  |  BA A380's are showing their age, hopefully ...      3  United Kingdom
2  |   Credit to BA - Flew to Singapore recently ...      4  United Kingdom
3  |   The check in area for premium classes at G...      9  United Kingdom
4  |  The flight took off a little late due to He...      9  United Kingdom

In [4]:
df["reviews"] = df["reviews"].str.replace("|", "")
df.head()

C:\Users\user\AppData\Local\Temp\ipykernel_2436\2147462081.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df["reviews"] = df["reviews"].str.replace("|", "")

                                             reviews  stars         country
0   Once again a terrible business class experien...      5  United Kingdom
1    BA A380's are showing their age, hopefully t...      3  United Kingdom
2     Credit to BA - Flew to Singapore recently a...      4  United Kingdom
3     The check in area for premium classes at Ga...      9  United Kingdom
4    The flight took off a little late due to Hea...      9  United Kingdom

In [5]:
df.dtypes

reviews    object
stars       int64
country    object
dtype: object

In [7]:
df.isnull().sum()

reviews    0
stars      0
country    0
dtype: int64

In [8]:
df.to_csv("data/BA_reviews_cleaned.csv")